# Excercise - 3

# Housing Market

# Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

# Create 3 differents Series, each of length 100, as follows:
#1 The first a random number from 1 to 4
#2 The second a random number from 1 to 3
#3 The third a random number from 10,000 to 30,000

In [6]:
series1 = pd.Series(np.random.randint(1, high = 5, size = 100, dtype = 'l'))

series2 = pd.Series(np.random.randint(1, high = 4,size = 100, dtype = 'l'))

series3 = pd.Series(np.random.randint(10000, high = 30001, size = 100, dtype = 'l'))

In [7]:
print(series1,series2,series3)

0     4
1     1
2     3
3     1
4     2
     ..
95    4
96    4
97    1
98    4
99    3
Length: 100, dtype: int32 0     3
1     3
2     1
3     2
4     2
     ..
95    2
96    1
97    3
98    3
99    3
Length: 100, dtype: int32 0     27648
1     26894
2     25478
3     28021
4     17499
      ...
95    18848
96    21237
97    18155
98    14602
99    15400
Length: 100, dtype: int32

# Let's create a DataFrame by joinning the Series by column

In [10]:
house_df = pd.concat([series1,series2,series3], axis = 1)

house_df

    0  1      2
0   4  3  27648
1   1  3  26894
2   3  1  25478
3   1  2  28021
4   2  2  17499
.. .. ..    ...
95  4  2  18848
96  4  1  21237
97  1  3  18155
98  4  3  14602
99  3  3  15400

[100 rows x 3 columns]

# Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [13]:
house_df.rename(columns={0: 'bedrs',
                   1: 'bathrs',
                        2:'price_sqr_meter'},
          inplace=True, errors='raise')

In [14]:

house_df

    bedrs  bathrs  price_sqr_meter
0       4       3            27648
1       1       3            26894
2       3       1            25478
3       1       2            28021
4       2       2            17499
..    ...     ...              ...
95      4       2            18848
96      4       1            21237
97      1       3            18155
98      4       3            14602
99      3       3            15400

[100 rows x 3 columns]

# Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [18]:
bigcolumn = pd.concat([series1,series2,series3])

bigcolumn = bigcolumn.to_frame()

bigcolumn

        0
0       4
1       1
2       3
3       1
4       2
..    ...
95  18848
96  21237
97  18155
98  14602
99  15400

[300 rows x 1 columns]

# Oops, it seems it is going only until index 99. Is it true?

In [22]:
len(bigcolumn)

300

# Reindex the DataFrame so it goes from 0 to 299

In [24]:
bigcolumn.reset_index(drop=True, inplace=True)

In [25]:
bigcolumn

         0
0        4
1        1
2        3
3        1
4        2
..     ...
295  18848
296  21237
297  18155
298  14602
299  15400

[300 rows x 1 columns]